Tornado_humidifier/OpenFoam_CaseFile/Tornado_humidifier/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.3.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    location "0";
    object U;
}
dimensions [ 0 1 -1 0 0 0 0 ];
internalField      uniform (0.0 0.0 0.0);
boundaryField
{

    Tornado_humidifier_wall
    {
        type            noSlip;
    }
    Tornado_humidifier_airInletYminus
    {
//        type            inletOutlet;
//        inletValue           uniform (0 0 0);
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    Tornado_humidifier_airInletYplus
    {
//        type            inletOutlet;
//        inletValue           uniform (0 0 0);
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    Tornado_humidifier_inlet
    {
        type            zeroGradient;
    }
    Tornado_humidifier_outlet
    {
        type            fixedValue;
        value           uniform (0 0 0.8);
    }
    Tornado_humidifier_bottom
    {
        type            noSlip;
    }
    Tornado_humidifier_top
    {
        type            noSlip;
    }
    Tornado_humidifier_fin
    {
        type            noSlip;
    }
}

// ************************************************************************* //
